cdhmcp/dspic33A-pfc-controller/dspic33A-pfc-controller.X/mcc_generated_files/pwm_hs/pwm.h
}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function enables ADC trigger 2 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @pre        Trigger value has to be set using \ref PWM_TriggerACompareValueSet, 
 *             \ref PWM_TriggerBCompareValueSet or \ref PWM_TriggerCCompareValueSet
 *             before calling this function.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator trigger compare register 
 * @return     none  
 */
inline static void PWM_Trigger2Enable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVT2bits.ADTR2EN1 = 1;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVT2bits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVT2bits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

}  

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function disables ADC trigger 2 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator trigger compare register 
 * @return     none  
 */
inline static void PWM_Trigger2Disable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVT2bits.ADTR2EN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVT2bits.ADTR2EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVT2bits.ADTR2EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function enables DAC trigger for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @pre        Trigger value has to be set using \ref PWM_TriggerDCompareValueSet or 
 *             \ref PWM_TriggerECompareValueSet before calling this function.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator number
 * @return     none  
 */
inline static void PWM_DACTriggerEnable(enum PWM_GENERATOR genNum, enum PWM_DAC_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_D:
                                        PG1EVT1bits.DACTREN1 = 1;
                                        break;       
                        case PWM_TRIGGER_COMPARE_E:
                                        PG1EVT1bits.DACTREN2 = 1;
                                        break;
                        default:break;  
                }              
                break;       
        default:break;    
    }
}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function disables DAC trigger for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator number
 * @return     none  
 */
inline static void PWM_DACTriggerDisable(enum PWM_GENERATOR genNum, enum PWM_DAC_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_D:
                                        PG1EVT1bits.DACTREN1 = 0;
                                        break;       
                        case PWM_TRIGGER_COMPARE_E:
                                        PG1EVT1bits.DACTREN2 = 0;
                                        break;
                        default:break;  
                }              
                break;       
        default:break;    
    }
}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function clears the status of PWM latched fault mode for the PWM Generator 
 *             selected by the argument \ref PWM_GENERATOR.   
 * @param[in]  genNum - PWM generator number
 * @return     none  
 */
inline static void PWM_FaultModeLatchClear(enum PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                PG1F1PCI1bits.SWTERM = 1;
                break;   
        default:break;   
    }   
}

/**
 * @ingroup    pwmhsdriver
 * @brief      This function can be used to override default callback 
 *             \ref PWM_GeneratorEOCEventCallback and to define custom callback for 
 *             PWM EOCEvent event.
 * @param[in]  callback - Address of the callback function
 * @return     none  
 */
void PWM_GeneratorEOCEventCallbackRegister(void (*callback)(enum PWM_GENERATOR genNum));

/**
 * @ingroup    pwmhsdriver
 * @brief      This is the default callback with weak attribute. The user can 
 *             override and implement the default callback without weak attribute 
 *             or can register a custom callback function using PWM_EOCEventCallbackRegister.
 * @param[in]  genNum - PWM generator number
 * @return     none  
 */
void PWM_GeneratorEOCEventCallback(enum PWM_GENERATOR genNum);


/**
 * @ingroup    pwmhsdriver
 * @brief      This is a tasks function for PWM1
 * @param[in]  intGen - PWM generator number
 * @return     none  
 */
void PWM_GeneratorTasks(enum PWM_GENERATOR intGen);

/**
 * @ingroup    pwmhsdriver
 * @brief      This function can be used to override default callback 
 *             \ref PWM_CommonEventCallback and to define custom callback for 
 *             PWM CommonEvent event.
 * @param[in]  callback - Address of the callback function
 * @return     none  
 */
void PWM_CommonEventCallbackRegister(void (*callback)(enum PWM_COMMON_EVENT event));

/**
 * @ingroup    pwmhsdriver
 * @brief      This is the default callback with weak attribute. The user can 
 *             override and implement the default callback without weak attribute 
 *             or can register a custom callback function using PWM_CommonEventCallbackRegister.
 * @param[in]  event - Common event instance
 * @return     none  
 */
void PWM_CommonEventCallback(enum PWM_COMMON_EVENT event);

/**
 * @ingroup    pwmhsdriver
 * @brief      This function call used only in polling mode, if commonEvent occured for PWM, 
 *             then calls the respective callback function
 * @param[in]  event - Common event instance           
 * @return     none
 */
void PWM_CommonEventTasks(enum PWM_COMMON_EVENT event);

#endif //PWM_H

